Revit 2027 API
ParameterTypeId.ViewFamily Property
 "Family"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewFamily { get; }
Public Shared ReadOnly Property ViewFamily As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewFamily {
	ForgeTypeId^ get ();
}
static member ViewFamily : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace